Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཉིད་ཀྱང་སྒྱུ་མ།
en: Mentally compounded sensory contact [and so forth] are themselves illusion, and illusion itself is mentally compounded sensory contact [and so forth].

source: སྒྱུ་མ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའོ། །བཅོམ་ལྡན་འདས་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, feelings conditioned by visually compounded sensory contact are not one thing and illusions another.

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།
en: Feelings conditioned by visually compounded sensory contact are themselves illusion, and illusion itself is feelings conditioned by visually compounded sensory contact.

source: །བཅོམ་ལྡན་འདས་རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡང་གཞན་མ་ལགས།
en: Blessed Lord, feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are not one thing and illusions another.

source: སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།
en: Feelings conditioned by mentally compounded sensory contact [and so forth] are themselves illusion, and illusion itself is feelings conditioned by mentally compounded sensory contact [and so forth].

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, [the causal attributes], up to and including the factors conducive to enlightenment, are not one thing and illusions another.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ།
en: The factors conducive to enlightenment [and so forth] are themselves illusion, and illusion itself is the factors conducive to enlightenment [and so forth].

source: །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་ཀྱང་སྒྱུ་མ།
en: Blessed Lord, [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are not one thing and illusions another.

source: སྒྱུ་མ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ།
en: The eighteen distinct qualities of the buddhas [and so forth] are themselves illusion, and illusion itself is the eighteen distinct qualities of the buddhas [and so forth].

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་བར་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, [the attainments], up to and including enlightenment, are not one thing and illusions another.

source: བྱང་ཆུབ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་བྱང་ཆུབ་བོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Enlightenment is itself illusion, and illusion itself is enlightenment.” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མ་ལ་སྐྱེ་བའམ། འགག་པ་ཡོད་དམ།
en: Subhūti, do you think that there is arising or cessation with respect to that illusion?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ།
en: No, Blessed Lord!”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མ་ལ་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བ་ཡོད་དམ།
en: Subhūti, do you think that there is affliction or purification with respect to that illusion?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, Blessed Lord!” he replied. “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་ལ་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་རྣམ་པར་བྱང་བ་མེད་པ་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ། དེ་བཞིན་དུ་བསམ་གཏན་དང་། བརྩོན་འགྲུས་དང་། བཟོད་པ་དང་། ཚུལ་ཁྲིམས་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་།
en: Subhūti,” asked the Blessed One, “do you think that that which is without arising, cessation, affliction, or purification can train in the perfection of wisdom and be emancipated in all-aspect omniscience, or that it will [subsequently] attain all-aspect omniscience?

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ།
en: Similarly, do you think that it can train in the perfections of meditative concentration, perseverance, tolerance, ethical discipline, and generosity, or in the emptiness of internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, or in [the causal and fruitional attributes], from the thirty-seven factors conducive to enlightenment up to the eighteen distinct qualities of the buddhas, and be emancipated in all-aspect omniscience, or that it will [subsequently] attain all-aspect omniscience?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མི་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, Blessed Lord!”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: he replied. “

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་འདི་དག་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་དང་། བརྡ་དང་། གདགས་པ་དང་། ཐ་སྙད་དུ་བྱ་བ་ཡིན་ནམ།
en: Subhūti,” asked the Blessed One, “do you think that the notion, symbol, designation, or term bodhisattva applies to these five acquisitive psycho-physical aggregates, or to [the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། འདུ་ཤེས་དང་། བརྡ་དང་།
en: No, Blessed Lord!”

source: གདགས་པ་དང་།
en: he replied. “

source: ཐ་སྙད་ཙམ་གྱིས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་སྐྱེ་བའམ། འགག་པའམ། ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བར་དམིགས་པར་འགྱུར་རམ།
en: Subhūti,” asked the Blessed One, “do you think that on the basis of a mere notion, symbol, designation, or term one can apprehend arising, cessation, affliction, or purification with respect to these five acquisitive psycho-physical aggregates, or to [the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མི་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་ལ་འདུ་ཤེས་མེད་ཅིང་བརྡ་མེད་པ་དང་། གདགས་པ་མེད་པ་དང་། ཐ་སྙད་མེད་པ་དང་། མིང་མེད་པ་དང་། མིང་དུ་གདགས་པ་མེད་པ་དང་། ལུས་མེད་པ་དང་། ལུས་ཀྱི་ལས་མེད་པ་དང་། ངག་མེད་པ་དང་། ངག་གི་ལས་མེད་པ་དང་།
en: No, Blessed Lord!”

source: ཡིད་མེད་པ་དང་། ཡིད་ཀྱི་ལས་མེད་པ་དང་།
en: he replied. “

source: སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ། དེ་བཞིན་དུ་བསམ་གཏན་དང་། བརྩོན་འགྲུས་དང་། བཟོད་པ་དང་། ཚུལ་ཁྲིམས་དང་།
en: Subhūti,” asked the Blessed One, “do you think that that which is without notion, without symbol, without designation, without conventional expression, without name, without denomination, without corporeal form, without physical actions, without speech, without verbal actions, without mind, without mental actions, without arising, without ceasing, without affliction, and without purification can train in the perfection of wisdom and then be emancipated in all-aspect omniscience, or that it will [subsequently] attain all-aspect omniscience?

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ནང་སྟོང་པ་ཉིད་ནས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་པར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ།
en: Similarly, do you think that it can train in the perfections of meditative concentration, perseverance, tolerance, ethical discipline, and generosity, or in the emptiness of internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, or in [the causal and fruitional attributes], from the thirty-seven factors conducive to enlightenment up to the eighteen distinct qualities of the buddhas, and be emancipated in all-aspect omniscience, or that it will [subsequently] attain all-aspect omniscience?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མི་འགྱུར་རོ།
en: No, Blessed Lord!”

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་།
en: Subhūti, so it is that when bodhisattva great beings have trained in the perfection of wisdom, by way of not apprehending anything, they will be emancipated in all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །གསོལ་པ།
en: They will attain all-aspect omniscience,” said the Blessed One. “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། སྒྱུ་མའི་སྐྱེས་བུས་བསླབ་པ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསླབ་པར་བགྱིའོ།
en: Blessed Lord, bodhisattva great beings who train in the perfection of wisdom accordingly should train in unsurpassed, complete enlightenment, in the manner of an illusory person.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟ་སྟེ། ཕུང་པོ་ལྔ་པོ་དེ་ཉིད་སྒྱུ་མའི་སྐྱེས་བུར་རིག་པར་བགྱི་བ་ཤ་སྟག་གོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: If one were to ask why, Blessed Lord, it is so that these five psycho-physical aggregates might be entirely understood to resemble an illusory person.” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཕུང་པོ་ལྔ་པོ་འདི་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ།
en: Subhūti, do you think that these five psycho-physical aggregates can train in the perfection of wisdom and be emancipated in all-aspect omniscience?” {

source: བཅོམ་ལྡན་འདས་དེ་ནི་མི་འགྱུར་རོ།
en: No, Blessed Lord!”

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: he replied. “

source: བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཕུང་པོ་ལྔ་རྣམས་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་ཏེ། དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་དེ་ནི་དམིགས་སུ་མ་མཆིས་སོ།
en: And if one were to ask why, Blessed Lord, it is because the five psycho-physical aggregates have an intrinsic nature of nonentity, and the intrinsic nature of nonentity is nonapprehensible.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རྨི་ལམ་ལྟ་བུའི་ཕུང་པོ་ལྔ་པོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ།
en: Subhūti, do you think that these five psycho-physical aggregates can, in a dreamlike manner, train in the perfection of wisdom and be emancipated in all-aspect omniscience?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་རྨི་ལམ་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་ཏེ། དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་དེ་ནི་དམིགས་སུ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མ་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་།
en: And if one were to ask why, Blessed Lord, it is because dreams have an intrinsic nature of nonentity, and the intrinsic nature of nonentity is nonapprehensible.” “

source: མིག་ཡོར་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུའི་ཕུང་པོ་ལྔ་པོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ།
en: Subhūti, do you think that these five psycho-physical aggregates can, in the manner of a magical display, in the manner of an echo, in the manner of an optical aberration, in the manner of the moon in water, in the manner of a mirage, or in the manner of a phantom, train in the perfection of wisdom and be emancipated in all-aspect omniscience?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་སྒྱུ་མ་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན། སྒྲ་བརྙན་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན། མིག་ཡོར་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན། ཆུ་ཟླ་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན། སྨིག་རྒྱུ་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན། སྤྲུལ་པ་ནི་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་ཏེ། དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་དེ་ནི་དམིགས་སུ་མ་མཆིས་སོ།
en: And if one were to ask why, Blessed Lord, it is because magical displays have the intrinsic nature of nonentity, echoes have the intrinsic nature of nonentity, optical aberrations have the intrinsic nature of nonentity, the moon in water has the intrinsic nature of nonentity, mirages have the intrinsic nature of nonentity, phantoms have the intrinsic nature of nonentity, and the intrinsic nature of nonentity is nonapprehensible.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་ནི་རྨི་ལམ་ལྟ་བུ། ཚོར་བ་ནི་རྨི་ལམ་ལྟ་བུ། འདུ་ཤེས་ནི་རྨི་ལམ་ལྟ་བུ། འདུ་བྱེད་ནི་རྨི་ལམ་ལྟ་བུ། རྣམ་པར་ཤེས་པ་ནི་རྨི་ལམ་ལྟ་བུ་སྟེ།
en: The Blessed One said, “So it is, Subhūti, that physical forms are like a dream, feelings are like a dream, perceptions are like a dream, formative predispositions are like a dream, and consciousness is like a dream.

source: རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་དབང་པོ་དྲུག་གོ །དེ་ནི་ཕུང་པོ་ལྔའོ།
en: What is true of consciousness is true of the six sense organs, and what is true of the six sense organs is true of the five psycho-physical aggregates.

source: །རབ་འབྱོར་གཟུགས་ནི་སྒྱུ་མ་ལྟ་བུའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: Subhūti, physical forms are like a magical display, and feelings, perceptions, formative predispositions, and consciousness are like a magical display.

source: །རབ་འབྱོར་གཟུགས་ནི་སྒྲ་བརྙན་ལྟ་བུའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་སྒྲ་བརྙན་ལྟ་བུ་སྟེ།
en: Subhūti, physical forms are like an echo, and feelings, perceptions, formative predispositions, and consciousness are like an echo.

source: །རབ་འབྱོར་གཟུགས་ནི་མིག་ཡོར་ལྟ་བུའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་མིག་ཡོར་ལྟ་བུ་སྟེ།
en: Subhūti, physical forms are like an optical aberration, and feelings, perceptions, formative predispositions, and consciousness are like an optical aberration.

source: །རབ་འབྱོར་གཟུགས་ནི་ཆུ་ཟླ་ལྟ་བུའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་ཆུ་ཟླ་ལྟ་བུ་སྟེ།
en: Subhūti, physical forms are like the moon in water, and feelings, perceptions, formative predispositions, and consciousness are like the moon in water.

source: རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་དབང་པོ་དྲུག་གོ །
en: What is true of consciousness is true of the six sense organs, and what is true of the six sense organs is true of the five psycho-physical aggregates.

source: དེ་ནི་ཕུང་པོ་ལྔའོ་རབ་འབྱོར་གཟུགས་ནི་སྨིག་རྒྱུ་ལྟ་བུའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ།
en: Subhūti, physical forms are like a mirage, and feelings, perceptions, formative predispositions, and consciousness are like a mirage.

source: །རབ་འབྱོར་གཟུགས་ནི་སྤྲུལ་པ་ལྟ་བུའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་སྤྲུལ་པ་ལྟ་བུ་སྟེ།
en: Subhūti, physical forms are like a phantom, and feelings, perceptions, formative predispositions, and consciousness are like a phantom.

source: །དེ་དག་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་མི་དམིགས་སོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་མི་དམིགས་སོ། །གསོལ་པ།
en: Owing to the emptiness of internal phenomena, these are not apprehended, and owing to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, these are not apprehended.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པས་བསྟན་པ་འདི་ཐོས་ན། འཇིགས་ཤིང་སྔང་བ་དང་། སྐྲག་པར་མི་འགྱུར་ལགས་གྲང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, in that case, will bodhisattva great beings who have newly embarked upon the [Great] Vehicle not be afraid, fearful, and terrified when they hear this teaching?” “

source: རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་ཡང་ཡིན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཐབས་ཀྱང་མི་མཁས་པ་ཞིག་སྟེ། དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་ཡང་མ་འོངས་ན། འཇིགས་ཤིང་དངང་བ་དང་། སྐྲག་པར་ཡང་འགྱུར་རོ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who newly embark on the [Great] Vehicle will be afraid, fearful, and terrified if they are unskilled in the perfection of wisdom, and if they are not taken in hand by a spiritual mentor.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསྟན་པ་འདི་ཐོས་ན་མི་འཇིགས། མི་དང་མི་སྐྲག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་མཁས་པ་དེ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, when bodhisattva great beings hear this teaching, what is the skill in means that enables them to practice the perfection of wisdom without being afraid, without being fearful, and without being terrified?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, because their intention is directed toward all-aspect omniscience, while they discern that physical forms are impermanent they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, {Dt.155} and consciousness are impermanent they do not apprehend that.

source: །རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་མཁས་པའོ།
en: This, Subhūti, is the skill in means through which bodhisattva great beings practice the perfection of wisdom. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་སྡུག་བསྔལ་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, because their intention is directed toward all-aspect omniscience, while they discern that physical forms are imbued with suffering they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱི་གཟུགས་བདག་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are not a self they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བདག་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are not a self they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་ཞི་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are at peace they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞི་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are at peace they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་སྟོང་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are empty they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are empty they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་མཚན་མ་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are signless they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are signless they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་སྨོན་པ་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are without aspirations they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are without aspirations they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་མངོན་པར་འདུ་བྱ་བ་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are unconditioned they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མངོན་པར་འདུ་བྱ་བ་མེད་ཅེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are unconditioned they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། གཟུགས་དབེན་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: Because their intention is directed toward all-aspect omniscience, while they discern that physical forms are void they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་ཞེས་བྱ་བར་རྟོག་སྟེ། དེ་མི་དམིགས་སོ།
en: While they discern that feelings, perceptions, formative predispositions, and consciousness are void they do not apprehend that.

source: །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་མཁས་པའོ།
en: This, Subhūti, is the skill in means of bodhisattva great beings who practice the perfection of wisdom. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་གཟུགས་མི་རྟག་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are impermanent they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are impermanent they do not apprehend that.

source: དེ་མི་དམིགས་སོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་སྡུག་བསྔལ་བའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are imbued with suffering they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་བའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering they do not apprehend that.
